//ICET03   JOB NOTIFY=&SYSUID                                     
//*                                                               
//* COPIA DATOS DE UN ARCHIVO A OTRO.                             
//*                                                               
//*------------------------------------------------------------*  
//STEP010  EXEC PGM=ICETOOL                                       
//*------------------------------------------------------------*  
//DFSMSG   DD SYSOUT=*                                            
//TOOLMSG  DD SYSOUT=*                                            
//DD1      DD *                                                   
20000000003400000647                                              
20000000003400000645                                              
20000000003400000647                                              
20000000003400000645                                              
20000000003400000647                                              
20000000003400000645                                              
20000000005500000641                                              
20000000003400000647                                              
//DD2      DD SYSOUT=*    
//TOOLIN   DD *           
 COPY FROM(DD1) TO(DD2)   
/*                          