//JGDGMOD   JOB (99),'ALTER GDG',CLASS=A,MSGCLASS=Q,MSGLEVEL=(1,1),
//  REGION=0M,NOTIFY=&SYSUID
//*************************************************************
//* COPIAR UN PS EN UNA NUEVA GENERACION DEL GDG              *
//*************************************************************
//ALTERDG  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  ALTER UDEMY.CURSO.GDG LIMIT(15)
/*
